{
    "JwtKey": "c3VwZXJTZWNyZXRKV1RLRVk=",
    "ListenAddress": "0.0.0.0:80",
    "Challenges": [
        {
            "Flag": "FLAG{I_AM_SPEED}"
            "Email": "Hey newbie,\n\nSo I know you haven't quite finished the intro tasks yet, but we've just got word from our monitoring team that someone is trying to use a Dictionary brute force to login to our staff portal. I've got the traffic logs here and it's all hands on deck, so I'm going to have to pull you away from the intro tasks to help us out. Can you take a look and figure out which IP address the attacker is coming from so we can IP ban them?\n\n[Incident logs](link to email.dump)\n\nThanks so much,\n\nAdam\nWork Experience Manager\n"
        },
        {
            "Flag": "FLAG{I_AM_SPEED}",
            "Email": "Hi,\n\nApologies, I seem to have attached the wrong file to the last email. Please do not read the last file, it was a confidential matter. Instead, please see the correct data at https://attack-check.corp.geegle.org.\n\nThanks,\n\nAdam\nWork Experience Manager"
        },
        {
            "Flag": "FLAG{NICE_FIND}",
            "Email": "Hey,\n\nWe forgot to get you setup with access to a few systems unfortunately, which is going to slow work down for a while. Ideally, you should have access to both [Intranet](web-intranet) and [Account Manager](web-intern-account-manager), however neither of these have been setup for you. Unfortunately the HR Rep is away on long service leave so we won't be able to put it through in time - what I've managed to do is organise permission for you to perform a security audit of the [intranet](web-intranet) services - if you can get into it, you can update the records yourself. We do NOT have permission for a similar test on [Account Manager](web-intern-account-manager), but if the HR Rep gets it changed while he's away he'll send you a secret code - send it to me if you get it so I can verify it's sorted thanks.\n\nI suppose if you want to get paid, you better get onto it!\n\nCheers,\n\nAdam\nWork Experience Manager"
        },
        {
            "Flag": "",
            Email: "" 
        }
    ]


}
